aedile/EmberTide/sdkconfig.defaults
# sdkconfig.defaults — FiestaQuest ESP-IDF SDK configuration defaults
#
# Target: ESP32-S3-PICO-1-N8R8
#   - Xtensa LX7 dual-core @ 240 MHz
#   - 8 MiB SPI Flash (QD)
#   - 8 MiB Octal PSRAM (SPIRAM)
#
# These settings are applied before sdkconfig. Any key not listed here
# uses the ESP-IDF component default.

# ---------------------------------------------------------------------------
# Partition table
# ---------------------------------------------------------------------------
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ---------------------------------------------------------------------------
# Flash size
# ---------------------------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# ---------------------------------------------------------------------------
# SPIRAM (Octal PSRAM on ESP32-S3-PICO-1-N8R8)
# ---------------------------------------------------------------------------
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y

# SPIRAM: CAPS_ALLOC keeps malloc() on internal SRAM.
# PSRAM only used via explicit heap_caps_malloc(MALLOC_CAP_SPIRAM).
# This prevents I2S/GDMA driver allocations from landing in PSRAM
# (which causes LoadStoreAlignment crashes on ESP32-S3).
CONFIG_SPIRAM_USE_CAPS_ALLOC=y

# ---------------------------------------------------------------------------
# Target
# ---------------------------------------------------------------------------
CONFIG_IDF_TARGET="esp32s3"

# ---------------------------------------------------------------------------
# FreeRTOS
# ---------------------------------------------------------------------------
CONFIG_FREERTOS_HZ=1000

# ---------------------------------------------------------------------------
# Logging (default level: INFO; errors always logged)
# ---------------------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_BSP_AUDIO=y

# ES8311 codec support (used by codec_board for audio output)
CONFIG_CODEC_ES8311_SUPPORT=y
